{
  "ContentPacks": [
    {
      "authors": [
        "Karl Zimmerman"
      ],
      "id": "6472a84933135d108089a419",
      "date": "2023-05-28 00:00:00",
      "ArticleBody": [
        {
          "type": "paragraph",
          "content": "The towel is a user-friendly, safe way to keep yourself dry. It seems like towels are the best thing ever invented. They're the greatest!"
        },
        {
          "type": "paragraph",
          "content": "Wrong."
        },
        {
          "type": "paragraph",
          "content": "That's just what Big Towel has told you. Big Towel convinced you that you just NEED a towel. You've been lied to, scammed and gypped by the big towel corporations, and nobody's said anything about it."
        },
        {
          "type": "paragraph",
          "content": "I'm Karl Zimmermann, and I'm going to dive into why you should never buy another towel ever again."
        },
        {
          "type": "title1",
          "content": "Towel vs Sweater: Price breakdown"
        },
        {
          "type": "paragraph",
          "content": "Towels seem to be the ultimate balance between price and features. Yet another one of Big Towel's lies. It's shameful how much they've been able to brainwash the mainstream."
        },
        {
          "type": "paragraph",
          "content": "Let's examine the features and prices of the latest towel compared to the latest sweater."
        },
        {
          "type": "image",
          "content": "https://mtknews.cluster.ws/content/images/size/w1600/2023/05/Screenshot-2023-05-27-at-9.12.35-PM.png",
          "content 2": "Credit: Karl Zimmerman"
        },
        {
          "type": "paragraph",
          "content": "This is the Tommy Hilfiger Modern American Solid Bath Towel, 30 X 54 Inches, 100% Cotton 574 GSM in the Bright White colorway. This may seem like an impeccable value for such an incredible product, right?"
        },
        {
          "type": "paragraph",
          "content": "WRONG."
        },
        {
          "type": "paragraph",
          "content": "Remember that this is part of an industry paved with lies and scams."
        },
        {
          "type": "paragraph",
          "content": "Let's compare the flagship Hilfiger towel to a mid-range sweater option, the RBX Active Women's Mineral Washed Fleece Hoodie Pullover Relaxed Fit in XL size and grey colorway."
        },
        {
          "type": "image",
          "content": "https://mtknews.cluster.ws/content/images/size/w1600/2023/05/Screenshot-2023-05-27-at-9.14.47-PM.png",
          "caption": "Credit: Karl Zimmerman"
        },
        {
          "type": "paragraph",
          "content": "This may seem like a mediocre towel at first before you take note of its feature set compared to that of the towel. Let me break it down for you."
        },
        {
          "type": "image",
          "content": "https://mtknews.cluster.ws/content/images/2023/05/Screenshot-2023-05-27-at-9.18.12-PM.png",
          "caption": "Credit: Karl Zimmerman"
        },
        {
          "type": "paragraph",
          "content": "From this, you can clearly tell that the sweater is a better value for better features compared to the towel."
        },
        {
          "type": "title1",
          "content": "What can I do?"
        },
        {
          "type": "paragraph",
          "content": "You can fight back against Big Towel. You can organize boycotts, peaceful protests and demonstrations. You can wear more sweaters to signal your rebellion against Big Towel. Most importantly, don't contribute to these towel companies. Stop buying towels  Buy sweaters instead."
        }
      ]
    }
  ]
}